#pragma once


////////////////////////////////////////////////////////////////////////////////
//
//Интерфейс для наблюдения за действиями на панели управления документом
//
////////////////////////////////////////////////////////////////////////////////
class DocumentControlBarObserver
{
public:
  //-----------------------------------------------------------------------------
  //Деструктор по умолчанию для абстрактного класса.
  //---
  virtual ~DocumentControlBarObserver() = default;
  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке создания документа.
  //---
  virtual void OnCreateDocumentButtonClicked() = 0;
  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке сохранения документа.
  //---
  virtual void OnSaveDocumentButtonClicked() = 0;
  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке загрузки документа.
  //---
  virtual void OnLoadDocumentButtonClicked() = 0;
  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке экспорта документа в растровый формат.
  //---
  virtual void OnExportButtonClicked() = 0;
  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке отмены действия.
  //---
  virtual void OnUndoButtonClicked() = 0;
  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке повторения отмененного действия.
  //---
  virtual void OnRedoButtonClicked() = 0;
};
