#pragma once

////////////////////////////////////////////////////////////////////////////////
//
//Интерфейс для наблюдения за действиями на панели выбора фигуры
//
////////////////////////////////////////////////////////////////////////////////
class FiguresToolBarObserver
{
public:
  //-----------------------------------------------------------------------------
  //Деструктор по умолчанию для абстрактного класса.
  //---
  virtual ~FiguresToolBarObserver() = default;

  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке выбора отрезка.
  //---
  virtual void OnLineSegmentClicked() = 0;

  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке выбора ломанной.
  //--
  virtual void OnBrokenLineClicked() = 0;

  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке выбора прямоугольника, с отрисовкой через центр и угл.
  //---
  virtual void OnCentralPointRectangleClicked() = 0;

  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке выбора прямоугольника, с отрисовкой через два угла.
  //---
  virtual void OnAnglesRectangleClicked() = 0;
  //-----------------------------------------------------------------------------
  //Следит за переходом в процесс рисования по умолчанию
  //---
  virtual void OnDefaultProcess() = 0;
};
