#pragma once

////////////////////////////////////////////////////////////////////////////////
//
//Интерфейс для наблюдения за действиями на панели свойств отображения объектов.
//
////////////////////////////////////////////////////////////////////////////////
class PropertiesToolBarObserver
{
public:
  //-----------------------------------------------------------------------------
  //Деструктор по умолчанию для абстрактного класса.
  //---
  //--
  virtual ~PropertiesToolBarObserver() = default;

  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке выбора сплошной линии.
  //---
  virtual void OnSelectSolidLineButtonClicked() = 0;

  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке выбора пунктирной линии.
  //---
  virtual void OnSelectDasheLineButtonClicked() = 0;

  //-----------------------------------------------------------------------------
  //Следит за кликом по кнопке установки свойств по умолчанию.
  //---
  virtual void OnSetDefaultPropertiesButtonClicked() = 0;
};
