#pragma once

#include <QtWidgets>

#include "View/PropertiesToolBarObserver.h"
#include "View/Resources.h"


////////////////////////////////////////////////////////////////////////////////
//
/*В классе создаются и размещаются на layout все кнопки, меню и поля ввода для выбора свойств отображения объектов.
Список кнопок: открыть панель выбора цвета, выбрать стиль, установить значение по-умолчанию .
Поле ввода: указать толщину линий объекта. 
Меню: выбор стиля линий фигуры*/
//
////////////////////////////////////////////////////////////////////////////////
class PropertiesToolBar : public QWidget
{
  Q_OBJECT
  QPushButton * m_openColorsPanelButton = nullptr;
  QPushButton * m_lineStyle = nullptr;
  QMenu * m_styleMenu = nullptr;
  QLineEdit * m_widthLineEdit = nullptr;
  QPushButton * m_setBaseProperties = nullptr;
  std::weak_ptr<PropertiesToolBarObserver> m_observer;

public:
  //-----------------------------------------------------------------------------
  /*
 Конструтор. Создание и размещение всех кнопок, меню, поля ввода 
 для выбора параметров отображения, установка параметров отображения кнопок.
 */
  //--
  PropertiesToolBar(QWidget * parent = nullptr);

  //-----------------------------------------------------------------------------
  //Устанавливает наблюдателя.
  //--
  void SetObserver(std::weak_ptr<PropertiesToolBarObserver> observer);
private slots:
  //-----------------------------------------------------------------------------
  //Отображает панель выбора цвета
  //--
  void OpenColorsPanel();

  //-----------------------------------------------------------------------------
  //Сообщает наблюдателю о выборе сплошной линии для рисования.
  //--
  void SelectSolidLine(QAction * action);

  //-----------------------------------------------------------------------------
  //Сообщает наблюдателю о выборе пунктирной линии для рисования.
  //--
  void SelectDasheLine(QAction * action);

  //-----------------------------------------------------------------------------
  //Установка новой толщины линий для отрисовки
  //--
  void SetNewWidth();
  //-----------------------------------------------------------------------------
  //Сообщает наблюдателю об установке парамтеров отображения по умолчанию.
  //--
  void OnDefaltPropertiesButtonClicked();
};
