#pragma once

#include <QtWidgets>

#include "Model/Point.h"


////////////////////////////////////////////////////////////////////////////////
//
/*В классе содержатся данные об области просмотра, в частности: смещение и масштаб.
Реализованы функции увеличения, уменьшения масштаба, перевода координат из модельных и обратно.*/
//
////////////////////////////////////////////////////////////////////////////////
class ViewPort
{
  double m_scale = 1.0;
  const double m_scale_coefficient = 1.1;
  QPoint m_offset;

public:
  //-----------------------------------------------------------------------------
  //Получить масштаб.
  //---
  double GetScale() const noexcept { return m_scale; };

  //-----------------------------------------------------------------------------
  //Получить смещение по оси ОХ
  //---
  double Getdx() const noexcept { return m_offset.x(); };

  //-----------------------------------------------------------------------------
  //Получить смещение по оси OY
  //---
  double Getdy() const noexcept { return m_offset.y(); }

  //-----------------------------------------------------------------------------
  //Установить смещение по оси ОХ
  //---
  void Setdx(double x);

  //-----------------------------------------------------------------------------
  //Установить смещение по оси ОУ.
  //---
  void Setdy(double y);

  //-----------------------------------------------------------------------------
  //Установить масштаб.
  //---
  void SetScale(double scale);

  //-----------------------------------------------------------------------------
  //Увеличение масштаба в установленных пределах.
  //---
  void ZoomIn();

  //-----------------------------------------------------------------------------
  //Уменьшение масштаба в установленных пределах.
  //---
  void ZoomOut();

  //-----------------------------------------------------------------------------
  //Перевод координат в модельные.
  //---
  Point ToModel(const QPoint & pos);

  //-----------------------------------------------------------------------------
  //Перевод координат из модельных в координаты области просмотра.
  //---
  QPoint FromModel(const Point & pos);
};
