#pragma once

#include <QtWidgets/QMainWindow>

#include "Resources.h"
#include "ui_Vectify.h"


class FiguresToolBar;
class PropertiesToolBar;
class DocumentControlBar;
class WorkAreaWidget;


////////////////////////////////////////////////////////////////////////////////
//
/*В классе создаются и размещаются на главном окне основные виджеты приложения, такие, как:
панель управления документом, панель выбора фигуры, панель управления свойствами фигуры, рабочая область.
В классе также реализованы методы для обращения к элементам виджетов.*/
//
////////////////////////////////////////////////////////////////////////////////
class View : public QMainWindow
{
  Q_OBJECT
  DocumentControlBar * m_doc = nullptr;
  FiguresToolBar * m_figuresToolBar = nullptr;
  PropertiesToolBar * m_propertiesToolBar = nullptr;
  WorkAreaWidget * m_workArea = nullptr;

public:
  //-----------------------------------------------------------------------------
  //Конструтор. Создание и размещение всех виджетов приложения.
  //--
  View(QWidget * parent = nullptr);

  //-----------------------------------------------------------------------------
  //Возводит в рабочей области флаг о необходимости перерисовки.
  //--
  void SetNeedRepaint();

  //-----------------------------------------------------------------------------
  /*
Возвращает указатель на панель управления документом.
 */
  //--
  DocumentControlBar * GetDocumentControlBar();

  //-----------------------------------------------------------------------------
  //Возвращает указатель на панель выбора фигуры.
  //--
  FiguresToolBar * GetFiguresToolBar();

  //-----------------------------------------------------------------------------
  //Возвращает указатель на панель свойств фигур.
  //--
  PropertiesToolBar * GetPropertiesToolBar();

  //-----------------------------------------------------------------------------
  //Возвращает указатель на рабочую область.
  //--
  WorkAreaWidget * GetWorkArea();

  //-----------------------------------------------------------------------------
  //Изменяет параметр отображения кнопок undo/redo.
  //--
  void SetEnabledUndoRedo(bool undosStatus, bool redoStatus);

  //-----------------------------------------------------------------------------
  //Изменяет параметры отображения кнопки save.
  //--
  void SetEnabledSave(bool state);

  //-----------------------------------------------------------------------------
  //Сбрасывает все активные кнопки на панели фигур.
  //--
  void ResetAllButtons();

  //-----------------------------------------------------------------------------
  //Деструктор по умолчанию для базового класса
  //--
  ~View() = default;

private:
  Ui::VectifyClass m_ui;
};
