#pragma once

#include "Model/Point.h"


////////////////////////////////////////////////////////////////////////////////
//
/*Реализация котрольной точки геометрического объекта. Благодаря контрольной
точке, можно изменять координаты вершин объекта на рабочей области..*/
//
////////////////////////////////////////////////////////////////////////////////
class ControlPoint
{
public:
  //-----------------------------------------------------------------------------
  //Виртуальный деструктор базового класса.
  //--
  virtual ~ControlPoint() = default;

  //-----------------------------------------------------------------------------
  //Устанавливает новую позицию контрольной точки.
  //--
  virtual void SetPosition(const Point & point) = 0;
  //-----------------------------------------------------------------------------
  //Уведомляет фигуру об изменении контрольной точки.
  //--
  virtual void ControlPointChanged() const noexcept = 0;

  //-----------------------------------------------------------------------------
  //Получить координаты контрольной точки.
  //--
  virtual Point GetPosition() const = 0;
};
